# GetProfiles Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationConfigurationInfo..::..GetProfiles Method
FabricationConfigurationInfo Class See Also
---
Return the profiles in the fabrication configuration.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public IList<string> GetProfiles()
```

Visual Basic
---
```text
Public Function GetProfiles As IList(Of String)
```

Visual C++
---
```text
public:
IList<String^>^ GetProfiles()
```

# Remarks
The global profile name is empty, and is not returned here.
# See Also
FabricationConfigurationInfo Class
Autodesk.Revit.DB Namespace